# Напишите программу, которая по заданному номеру четверти, показывает диапазон возможных координат точек в этой четверти (x и y)

quarter_number = int(input("Введите номер четверти декартовой системы координат => "))

if quarter_number == 1:
    print("Коррдинаты точки могут принимать значения X > 0 и Y > 0")
elif quarter_number == 2:
    print("Коррдинаты точки могут принимать значения X < 0 и Y > 0")
elif quarter_number == 3:
    print("Коррдинаты точки могут принимать значения X < 0 и Y < 0")
elif quarter_number == 4:
    print("Коррдинаты точки могут принимать значения X > 0 и Y < 0")
else:
    print("Введите корректный номер четверти: 1, 2, 3 или 4!!!")