# Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.
# Пример:
    # - A (3,6); B (2,1) -> 5,09
    # - A (7,-5); B (1,-1) -> 7,21
import math

x_1 = float(input("Введите координату X1 => "))
y_1 = float(input("Введите координату Y1 => "))
x_2 = float(input("Введите координату X2 => "))
y_2 = float(input("Введите координату Y2 => "))

res = round(math.sqrt((x_2 - x_1)**2 + (y_2 - y_1)**2), 3)
print(f"Расстояние между точками равно {res}")